---
kind: enumMember
id: F:Autodesk.Revit.DB.TemporaryViewMode.RevealConstraints
enum: Autodesk.Revit.DB.TemporaryViewMode
source: html/8c0c72db-2801-3642-72bb-108cfdff23e1.htm
---
# Autodesk.Revit.DB.TemporaryViewMode.RevealConstraints

The view is in the mode that reveals constraints between elements in the model.